[
    {
        "id": "SPT-001",
        "title": "ICC T20 World Cup 2024: India Lifts Trophy After Thrilling Final Against Australia",
        "description": "In a nail-biting final at Kensington Oval, Barbados, Team India clinched their second T20 World Cup title by defeating Australia by 5 runs in a last-over thriller. Chasing India's competitive total of 185/7, Australia needed 15 runs from the final over, but Jasprit Bumrah's exceptional death bowling restricted them to 179/8. Virat Kohli was named Player of the Match for his magnificent 78 off 52 balls, while Suryakumar Yadav's 45 off 28 provided crucial momentum. Captain Rohit Sharma's tactical field placements and bowling changes proved decisive. The victory marks India's first ICC trophy since the 2013 Champions Trophy and ends their 11-year drought in global tournaments. Over 25,000 Indian fans in the stadium celebrated wildly as Hardik Pandya took the final catch at long-on. The win was particularly emotional for veterans Kohli and Sharma, both playing their last T20 World Cup. The team will receive a hero's welcome in India, with the BCCI announcing a ₹125 crore prize money for the squad.",
        "pubdate": "2024-06-29T23:45:00Z",
        "category": "sports",
        "country": "West Indies",
        "keywords": [
            "cricket",
            "T20 World Cup",
            "India vs Australia",
            "ICC trophy",
            "Virat Kohli"
        ],
        "language": "en",
        "images": [
            "https://images.unsplash.com/photo-1531415074968-036ba1b575da",
            "https://images.unsplash.com/photo-1531415074968-036ba1b575da",
            "https://images.unsplash.com/photo-1531415074968-036ba1b575da"
        ]
    },
    {
        "id": "SPT-002",
        "title": "Neeraj Chopra Breaks World Record: Throws 90.45m at Diamond League Paris",
        "description": "Olympic champion Neeraj Chopra created history at the Diamond League meet in Paris by breaking the javelin throw world record with a massive 90.45m throw. The previous record of 90.33m was held by Czech thrower Jan Železný since 1996. Chopra's record-breaking throw came in his fourth attempt, sailing past the 90-meter mark for the first time in his career. The Indian superstar was competing against world-class field including Germany's Johannes Vetter and Pakistan's Arshad Nadeem. Chopra's series read 85.12m, 86.45m, 88.34m, 90.45m (WR), 87.89m, and 89.12m - demonstrating remarkable consistency. This achievement makes him the first Indian track and field athlete to hold a world record. Prime Minister Narendra Modi immediately congratulated Chopra, calling it 'a golden moment for Indian sports'. The Athletics Federation of India announced a ₹5 crore reward for the historic achievement. Chopra dedicated the record to his coach Klaus Bartonietz and the support staff who helped him recover from injury earlier this season.",
        "pubdate": "2024-06-18T20:30:00Z",
        "category": "sports",
        "country": "France",
        "keywords": [
            "athletics",
            "javelin",
            "world record",
            "Neeraj Chopra",
            "diamond league"
        ],
        "language": "hi",
        "images": [
           
            "https://images.unsplash.com/photo-1461896836934-ffe607ba8211",
            "https://images.unsplash.com/photo-1552674605-db6ffd8facb5",
            "https://images.unsplash.com/photo-1552674605-db6ffd8facb5"
        ]
    },
    {
        "id": "SPT-003",
        "title": "Indian Women's Hockey Team Qualifies for Paris Olympics 2024",
        "description": "The Indian women's hockey team secured their spot in the Paris 2024 Olympics after a spectacular 3-1 victory over Germany in the FIH Olympic Qualifiers final in Ranchi. Captain Savita Punia led from the front with exceptional saves, while forwards Vandana Katariya (2 goals) and Deep Grace Ekka (1 goal) showcased clinical finishing. The team displayed remarkable defensive discipline, successfully defending 8 penalty corners. This qualification marks India's third consecutive Olympic appearance in women's hockey, following their historic fourth-place finish in Tokyo 2020. Coach Janneke Schopman's tactical masterclass was evident as the team executed high-press strategies perfectly. The victory sparked celebrations across the country, with President Droupadi Murmu and Sports Minister Anurag Thakur congratulating the team. The government announced a ₹10 crore preparation fund for the Olympic campaign. The team will now participate in exposure tours to Netherlands and Australia before the Olympics. This achievement is particularly significant as it comes after the men's team failed to qualify, putting additional pressure on the women's team to deliver.",
        "pubdate": "2024-01-15T18:15:00Z",
        "category": "sports",
        "country": "India",
        "keywords": [
            "hockey",
            "women's sports",
            "Olympics qualification",
            "Indian hockey",
            "Paris 2024"
        ],
        "language": "en",
        "images": [
            "https://images.unsplash.com/photo-1546519638-68e109498ffc",
            "https://images.unsplash.com/photo-1546519638-68e109498ffc",
            "https://images.unsplash.com/photo-1546519638-68e109498ffc"
        ]
    },
    {
        "id": "SPT-004",
        "title": "Pro Kabaddi League Season 10: Patna Pirates Win Record Fourth Title",
        "description": "Patna Pirates created history by winning their fourth Pro Kabaddi League title, defeating Puneri Paltan 42-38 in a thrilling final at the Gachibowli Stadium, Hyderabad. Captain Pardeep Narwal, the 'Dubki King', scored 18 raid points including 3 super raids, while defender Mohammadreza Chiyaneh contributed 5 tackle points. The match saw momentum shifts throughout, with Patna trailing 18-21 at halftime before mounting a spectacular comeback. The final minute saw dramatic action as Puneri Paltan attempted a do-or-die raid, only to be thwarted by Patna's corner combination. This victory solidifies Patna Pirates' status as the most successful franchise in PKL history. The season witnessed record viewership with 450 million cumulative viewers across Star Sports and Disney+ Hotstar. Emerging Player award went to 19-year-old Narender Kandola from Telugu Titans, while Best Defender was awarded to Fazel Atrachali. The league's success has prompted discussions about introducing women's PKL and expanding to international venues. BCCI Secretary Jay Shah announced plans to make kabaddi an Olympic demonstration sport by 2028.",
        "pubdate": "2024-02-28T21:45:00Z",
        "category": "sports",
        "country": "India",
        "keywords": [
            "kabaddi",
            "pro kabaddi league",
            "Patna Pirates",
            "PKL",
            "Indian sports"
        ],
        "language": "hi",
        "images": [
            "https://images.unsplash.com/photo-1571019613454-1cb2f99b2d8b",
            "https://images.unsplash.com/photo-1571019613454-1cb2f99b2d8b",
            "https://images.unsplash.com/photo-1571019613454-1cb2f99b2d8b"
        ]
    },
    {
        "id": "SPT-005",
        "title": "FIFA World Cup 2026 Qualifiers: India Stuns Qatar 2-1 in Historic Victory",
        "description": "In a monumental upset, the Indian men's football team defeated Asian champions Qatar 2-1 in their FIFA World Cup 2026 qualifier match at the Jassim bin Hamad Stadium, Doha. Sunil Chhetri, playing his 150th international match, scored a brace (38', 67') to secure India's first ever victory against Qatar in football history. The Blue Tigers displayed exceptional defensive organization, with goalkeeper Gurpreet Singh Sandhu making 8 crucial saves. Coach Igor Stimac's tactical masterclass saw India successfully implement a counter-attacking strategy against Qatar's 72% possession. The victory keeps India's World Cup qualification hopes alive, placing them second in Group E with 9 points from 5 matches. This result sent shockwaves through Asian football, with global media calling it 'the biggest upset in Asian qualifiers'. The All India Football Federation announced a ₹5 crore bonus for the team, while sponsors pledged additional support. Social media exploded with celebrations, with #BlueTigers trending worldwide. Former captain Bhaichung Bhutia called it 'the greatest result in Indian football history'. The team now needs to win their final match against Afghanistan to advance to the third round of qualifiers.",
        "pubdate": "2024-03-26T22:30:00Z",
        "category": "sports",
        "country": "Qatar",
        "keywords": [
            "football",
            "FIFA World Cup",
            "India football",
            "Sunil Chhetri",
            "World Cup qualifiers"
        ],
        "language": "en",
        "images": [
           
            "https://images.unsplash.com/photo-1575361204480-aadea25e6e68",
            "https://images.unsplash.com/photo-1575361204480-aadea25e6e68",
            "https://images.unsplash.com/photo-1575361204480-aadea25e6e68"
        ]
    },
    {
        "id": "SPT-006",
        "title": "PV Sindhu Wins Singapore Open 2024, Returns to Top 5 World Ranking",
        "description": "Two-time Olympic medalist PV Sindhu clinched the Singapore Open 2024 title with a commanding 21-15, 21-12 victory over world number 1 An Se-young of South Korea in the final. This victory marks Sindhu's first BWF Super 750 title since her return from injury and propels her back to world number 4 ranking. The Indian shuttler displayed exceptional court coverage and tactical variety, dominating the net exchanges and executing precise smashes. Sindhu's road to the final included victories over former world champion Nozomi Okuhara and current world number 3 Chen Yufei. Coach Park Tae-sang's training regime focusing on endurance and agility paid rich dividends as Sindhu looked sharper than ever. The win is particularly significant as it comes just 2 months before the Paris Olympics, establishing Sindhu as a gold medal contender. The Badminton Association of India announced a ₹50 lakh reward, while the Sports Ministry added another ₹30 lakh. Sindhu dedicated the victory to her parents and training partners who supported her during the difficult rehabilitation period. This triumph adds to India's growing badminton success following Lakshya Sen's recent German Open win.",
        "pubdate": "2024-05-19T17:20:00Z",
        "category": "sports",
        "country": "Singapore",
        "keywords": [
            "badminton",
            "PV Sindhu",
            "Singapore Open",
            "BWF",
            "Olympic medalist"
        ],
        "language": "hi",
        "images": [
           "https://img.olympics.com/images/image/private/t_s_16_9_g_auto/t_s_w1460/f_auto/primary/ds4wyvqjilsh9ywriakg",
            "https://images.unsplash.com/photo-1595435934249-5df7ed86e1d0",
            "https://images.unsplash.com/photo-1595435934249-5df7ed86e1d0",
            "https://images.unsplash.com/photo-1595435934249-5df7ed86e1d0"
        ]
    },
    {
        "id": "SPT-007",
        "title": "Formula 1: Indian Driver Jehan Daruvala Signs with Haas F1 Team for 2025 Season",
        "description": "In a historic moment for Indian motorsport, 25-year-old Jehan Daruvala has been signed by the Haas F1 Team as their race driver for the 2025 season, becoming the first Indian Formula 1 driver since Narain Karthikeyan in 2012. Daruvala's promotion comes after an impressive Formula 2 season where he finished third with 4 race wins and 8 podiums. The Mumbai-born driver will partner with experienced German driver Nico Hülkenberg, forming an exciting lineup for the American team. Daruvala's journey includes karting championships in India, Formula 4 success in Britain, and gradual progression through the junior formulae. The announcement was made at Haas headquarters in Kannapolis, North Carolina, with team principal Ayao Komatsu praising Daruvala's 'exceptional race craft and technical feedback'. The deal includes significant backing from Indian corporate sponsors, with Tata Group and Jio announced as principal partners. The first Indian Grand Prix since 2013 is being planned for 2026 at the Buddh International Circuit. Daruvala's debut will be watched by millions of Indian fans, potentially revolutionizing motorsport popularity in the country.",
        "pubdate": "2024-07-02T14:45:00Z",
        "category": "sports",
        "country": "United States",
        "keywords": [
            "formula 1",
            "F1",
            "motorsports",
            "Jehan Daruvala",
            "Indian driver"
        ],
        "language": "en",
        "images": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/F1_light_effects_%28cropped%29.jpg/800px-F1_light_effects_%28cropped%29.jpg",
            "https://images.unsplash.com/photo-1568605117036-5fe5e7bab0b7",
            "https://images.unsplash.com/photo-1568605117036-5fe5e7bab0b7",
            "https://images.unsplash.com/photo-1568605117036-5fe5e7bab0b7"
        ]
    },
    {
        "id": "SPT-008",
        "title": "National Games 2024: Maharashtra Tops Medal Tally with Record 150 Gold Medals",
        "description": "Maharashtra emerged as the overall champions at the 37th National Games held across five cities in Goa, amassing a record 150 gold, 120 silver, and 105 bronze medals for a total of 375 medals. Services Sports Control Board finished second with 115 golds, while Haryana placed third with 98 gold medals. The games witnessed 14 new national records, including swimmer Srihari Nataraj's 100m backstroke timing of 53.45 seconds and weightlifter Mirabai Chanu's 210kg total in 49kg category. Emerging talents included 16-year-old archer Ankita Bhakat who won 3 gold medals, and 17-year-old sprinter Akshay Nain who clocked 10.25 seconds in 100m. The games featured 43 sports disciplines with participation from over 10,000 athletes from 36 states and union territories. Prime Minister Narendra Modi inaugurated the games, emphasizing the 'Khelo India' initiative's success in identifying and nurturing talent. The Sports Authority of India announced direct entries to national camps for 250 outstanding performers. The event's success has prompted discussions about India's potential to host Asian Games 2030. Corporate sponsorship reached record ₹350 crore, indicating growing commercial interest in multi-sport events.",
        "pubdate": "2024-03-10T19:30:00Z",
        "category": "sports",
        "country": "India",
        "keywords": [
            "national games",
            "multi-sport event",
            "Khelo India",
            "Maharashtra",
            "sports records"
        ],
        "language": "hi",
        "images": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/National_Games_of_India_logo.png/800px-National_Games_of_India_logo.png",
            "https://images.unsplash.com/photo-1461896836934-ffe607ba8211",
            "https://images.unsplash.com/photo-1461896836934-ffe607ba8211",
            "https://images.unsplash.com/photo-1461896836934-ffe607ba8211"
        ]
    },
    {
        "id": "SPT-009",
        "title": "Tennis: Rohan Bopanna-Matt Ebden Win Wimbledon Men's Doubles Title",
        "description": "At 44 years old, Rohan Bopanna became the oldest man in the Open Era to win a Wimbledon title, partnering with Australia's Matt Ebden to claim the men's doubles championship. The Indo-Australian pair defeated defending champions Joe Salisbury and Rajeev Ram 6-4, 7-6(5), 6-7(4), 6-3 in a thrilling final that lasted 3 hours and 15 minutes. Bopanna's exceptional net play and Ebden's powerful serves proved decisive in crucial moments. This victory adds to Bopanna's Australian Open title earlier this year, making him only the third Indian after Leander Paes and Mahesh Bhupathi to win multiple Grand Slam doubles titles. The Bangalore veteran dedicated the win to his family and coaches who supported his career revival after considering retirement in 2019. Bopanna's triumph sparked celebrations across India, with tennis legends praising his longevity and dedication. The All India Tennis Association announced a ₹1 crore reward, while Karnataka government declared a ₹2 crore prize. Bopanna's success has inspired older athletes worldwide, proving that age is just a number in professional sports. The pair will now target the US Open to complete a calendar-year Grand Slam in men's doubles.",
        "pubdate": "2024-07-13T20:15:00Z",
        "category": "sports",
        "country": "United Kingdom",
        "keywords": [
            "tennis",
            "Wimbledon",
            "Rohan Bopanna",
            "Grand Slam",
            "doubles tennis"
        ],
        "language": "en",
        "images": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Rohan_Bopanna_Australian_Open_2014.jpg/800px-Rohan_Bopanna_Australian_Open_2014.jpg",
            "https://images.unsplash.com/photo-1595341888026-a392c81a9e8b",
            "https://images.unsplash.com/photo-1595341888026-a392c81a9e8b",
            "https://images.unsplash.com/photo-1595341888026-a392c81a9e8b"
        ]
    },
    {
        "id": "SPT-010",
        "title": "Asian Games 2026 Preparation: Sports Ministry Announces ₹2,000 Crore Training Plan",
        "description": "The Ministry of Youth Affairs and Sports has unveiled an ambitious ₹2,000 crore preparation plan for the 2026 Asian Games in Aichi-Nagoya, Japan, targeting India's best-ever performance. The 'Road to Nagoya 2026' initiative includes establishing 15 High-Performance Training Centers across the country, hiring 50 international coaches, and providing scientific support through partnerships with leading sports institutes. Focus sports include athletics, shooting, wrestling, boxing, and archery where India has strong medal prospects. The plan emphasizes early identification of talent, with 1,000 young athletes to be selected for the Target Olympic Podium Scheme (TOPS) development group. Foreign exposure tours to 20 countries have been scheduled, along with participation in World Championships and Continental Games. Sports Authority of India will establish sports science hubs in each training center, offering biomechanical analysis, nutrition planning, and psychological support. The government aims to improve India's position from fourth in 2022 to top three in 2026, targeting 100+ medals. Corporate partnerships with ₹500 crore have been secured, while celebrity athletes including Neeraj Chopra and PV Sindhu have been appointed as mentors for young athletes.",
        "pubdate": "2024-04-05T11:00:00Z",
        "category": "sports",
        "country": "India",
        "keywords": [
            "Asian Games",
            "sports ministry",
            "training plan",
            "Olympic preparation",
            "sports development"
        ],
        "language": "hi",
        "images": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/2022_Asian_Games_logo.svg/800px-2022_Asian_Games_logo.svg.png",
            "https://images.unsplash.com/photo-1461896836934-ffe607ba8211",
            "https://images.unsplash.com/photo-1461896836934-ffe607ba8211",
            "https://images.unsplash.com/photo-1461896836934-ffe607ba8211"
        ]
    }
]